#+TITLE: February 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | DEV.1549808449. Project Stacknews (2019-02-18)               |          |
|      |      |             |         | READ.1549808796. Learning How to Learn (2019-02-18)          |          |
|      |      |             |         | READ.1549896237. Emacs Bug Process (2019-02-18)              |          |
|      |      |             |         | READ.1545566270. [[https://github.com/maxogden/ (2019-02-18) |          |
|      |      |             |         | READ.1549883885. DS/Algo Foundation (2019-02-18)             |          |
|      |      |             |         | READ.1538996950. Linux for you and me (2019-02-18)           |          |
|      |      |             |         | READ.1549470496. Chapter 12. Reflection (2019-02-17)         |          |
|      |      |             |         | DEV.1549470564. Chapter 12 Exercises (2019-02-16)            |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+-----------+--------+------+-----------+--------------+------------|
| Sidntrivedi      |       3.5 |   3.36 |  3.5 |         0 |   2019-07-11 | ########## |
| Sandeepk         |        14 |  12.75 |   14 |         0 |   2019-07-11 | ########## |
| Nightwarrior-Xxx |         0 |      0 |    0 |         0 |   2019-07-11 | ---------- |
| Bhavin192        |      8.75 |   4.95 | 8.75 |         0 |   2019-07-11 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  30 ++---------+----------+---------+----------+----------+----------+---++   
:     |                                                                     |   
:     |    ###################################################CTUAL ####### |   
:  25 ++                                                      IDEAL .......++   
:     |    ......                                               #           |   
:     |          .....                                                      |   
:  20 ++              ......                                     ######    ++   
:     |                     .....                                      #    |   
:     |                          ....                                  #    |   
:  15 ++                             .                                  #  ++   
:     |                               ......                            #   |   
:     |                                     .....                        #  |   
:  10 ++                                         .....                   # ++   
:     |                                               ......              # |   
:     |                                                     ....          # |   
:   5 ++                                                        .          #+   
:     |                                                          ......    #|   
:     |                                                                .....*   
:   0 ++---------+----------+---------+----------+----------+----------+---+*   
:     0          2          4         6          8          10         12       
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                                                                |
|-----+------------+--------+-------+------------------------------------------------------------------------------------------------|
|   1 | 2019-02-06 |  26.25 |    24 |                                                                                                |
|   2 | 2019-02-07 |  26.25 |    22 |                                                                                                |
|   3 | 2019-02-08 |  26.25 |    20 |                                                                                                |
|   4 | 2019-02-09 |  26.25 |    18 |                                                                                                |
|   5 | 2019-02-10 |  26.25 |    16 |                                                                                                |
|   6 | 2019-02-11 |  26.25 |    14 |                                                                                                |
|   7 | 2019-02-12 |  26.25 |    12 |                                                                                                |
|   8 | 2019-02-13 |  26.25 |    10 |                                                                                                |
|   9 | 2019-02-14 |  26.25 |     8 |                                                                                                |
|  10 | 2019-02-15 |  26.25 |     6 |                                                                                                |
|  11 | 2019-02-16 |   19.5 |     4 | DEV.1549470564                                                                                 |
|  12 | 2019-02-17 |   17.5 |     2 | READ.1549470496                                                                                |
|  13 | 2019-02-18 |    0.0 |     0 | READ.1538996950 READ.1549883885 READ.1545566270 READ.1549896237 READ.1549808796 DEV.1549808449 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                   | TASKID          | OWNER       | PRIORITY | TODO | ESTIMATED | ACTUAL |
|------------------------+-----------------+-------------+----------+------+-----------+--------|
| TASKS                  |                 |             | B        |      |     26.25 |  21.06 |
|------------------------+-----------------+-------------+----------+------+-----------+--------|
| bhavin192              |                 |             | B        |      |      8.75 |   4.95 |
| Learning Golang        |                 |             | B        |      |      8.75 |   4.95 |
| Chapter 12. Reflection | READ.1549470496 | bhavin192   | B        | DONE |         2 |   2.37 |
| Chapter 12 Exercises   | DEV.1549470564  | bhavin192   | B        | DONE |      6.75 |   2.58 |
|------------------------+-----------------+-------------+----------+------+-----------+--------|
| sandeepk               |                 |             | B        |      |        14 |  12.75 |
| Project Stacknews      | DEV.1549808449  | sandeepk    | B        | DONE |         8 |   7.33 |
| Learning How to Learn  | READ.1549808796 | sandeepk    | B        | DONE |         4 |   4.00 |
| Emacs Bug Process      | READ.1549896237 | sandeepk    | B        | DONE |         2 |   1.42 |
|------------------------+-----------------+-------------+----------+------+-----------+--------|
| sidntrivedi            |                 |             | B        |      |       3.5 |   3.36 |
| [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]            | READ.1545566270 | sidntrivedi | B        | DONE |      0.75 |   1.00 |
| DS/Algo Foundation     | READ.1549883885 | sidntrivedi | B        | DONE |      1.75 |   1.63 |
| Linux for you and me   | READ.1538996950 | sidntrivedi | B        | DONE |         1 |   0.73 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-02-06 Wed>
  :wpd-bhavin192: 1
  :wpd-nightwarrior-xxx: 1.2
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 0.5
  :END:
** bhavin192
*** Learning Golang
**** DONE Chapter 12. Reflection [6/6]
     CLOSED: [2019-02-17 Sun 17:49]
     :PROPERTIES:
     :ESTIMATED: 2
     :ACTUAL:   2.37
     :OWNER:    bhavin192
     :ID:       READ.1549470496
     :TASKID:   READ.1549470496
     :END:
     :LOGBOOK:
     CLOCK: [2019-02-17 Sun 17:22]--[2019-02-17 Sun 17:49] =>  0:27
     CLOCK: [2019-02-16 Sat 19:10]--[2019-02-16 Sat 19:35] =>  0:25
     CLOCK: [2019-02-13 Wed 21:37]--[2019-02-13 Wed 21:56] =>  0:19
     CLOCK: [2019-02-07 Thu 21:39]--[2019-02-07 Thu 22:17] =>  0:38
     CLOCK: [2019-02-06 Wed 22:21]--[2019-02-06 Wed 22:48] =>  0:27
     CLOCK: [2019-02-06 Wed 22:15]--[2019-02-06 Wed 22:21] =>  0:06
     :END:
     - [X] 12.1 Why Reflection?                      (7m)
     - [X] 12.2 reflect.Type and reflect.Value       (15m)
     - [X] 12.3 Display, a Recursive Value Printer   (40m)
     - [X] 12.4 Example: Encoding S-Expressions      (25m)
     - [X] 12.5 Setting Variables with reflect.Value (15m)
     - [X] 12.6 Example: Decoding S-Expressions      (25m)
**** DONE Chapter 12 Exercises [3/3]
     CLOSED: [2019-02-16 Sat 17:48]
     :PROPERTIES:
     :ESTIMATED: 6.75
     :ACTUAL:   2.58
     :OWNER:    bhavin192
     :ID:       DEV.1549470564
     :TASKID:   DEV.1549470564
     :END:
     :LOGBOOK:
     CLOCK: [2019-02-16 Sat 17:23]--[2019-02-16 Sat 17:48] =>  0:25
     CLOCK: [2019-02-16 Sat 16:09]--[2019-02-16 Sat 16:25] =>  0:16
     CLOCK: [2019-02-13 Wed 22:36]--[2019-02-13 Wed 23:21] =>  0:45
     CLOCK: [2019-02-13 Wed 22:20]--[2019-02-13 Wed 22:28] =>  0:08
     CLOCK: [2019-02-13 Wed 19:42]--[2019-02-13 Wed 19:48] =>  0:06
     CLOCK: [2019-02-11 Mon 22:25]--[2019-02-11 Mon 23:15] =>  0:50
     CLOCK: [2019-02-07 Thu 22:50]--[2019-02-07 Thu 22:55] =>  0:05
     :END:
     - [X] 12.3        (1.75h)
     - [X] 12.4        (3h)
     - [X] 12.6 Part I (2h)
** sandeepk
*** DONE Project Stacknews [2/2]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   7.33
    :OWNER: sandeepk
    :ID: DEV.1549808449
    :TASKID: DEV.1549808449
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 16:00]--[2019-02-17 Sun 18:00] =>  2:00
    CLOCK: [2019-02-16 Sat 18:00]--[2019-02-16 Sat 19:00] =>  1:00
    CLOCK: [2019-02-10 Sun 16:00]--[2019-02-10 Sun 17:30] =>  1:30
    CLOCK: [2019-02-09 Sat 21:00]--[2019-02-09 Sat 22:20] =>  1:20
    CLOCK: [2019-02-09 Sat 13:00]--[2019-02-09 Sat 14:30] =>  1:30
    :END:
    - [X] User Add/Delete/Password Forget (4h)
    - [X] Post Add/Delete (4h)
*** DONE Learning How to Learn [1/1]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   4.00
    :OWNER: sandeepk
    :ID: READ.1549808796
    :TASKID: READ.1549808796
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-15 Fri 20:20]--[2019-02-15 Fri 21:30] =>  1:10
    CLOCK: [2019-02-13 Wed 20:00]--[2019-02-13 Wed 21:00] =>  1:00
    CLOCK: [2019-02-08 Fri 21:00]--[2019-02-08 Fri 21:50] =>  0:50
    CLOCK: [2019-02-07 Thu 20:30]--[2019-02-07 Thu 21:30] =>  1:00
    :END:
    - [X] Renaissance Learning and Unlocking Your Potential (4h)
*** DONE Emacs Bug Process [2/2]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.42
    :OWNER: sandeepk
    :ID: READ.1549896237
    :TASKID: READ.1549896237
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 12:00]--[2019-02-17 Sun 12:45] =>  0:45
    CLOCK: [2019-02-15 Fri 17:30]--[2019-02-15 Fri 18:10] =>  0:40
    :END:
    - [X] https://debbugs.gnu.org/server-control.html (1h)
    - [X] https://debbugs.gnu.org/server-request.html#introduction (1h)
** sidntrivedi
*** DONE [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 0.75
    :ACTUAL:   1.00
    :OWNER: sidntrivedi
    :ID: READ.1545566270
    :TASKID: READ.1545566270
    :END:      
    :LOGBOOK:  
    CLOCK: [2019-02-18 Mon 19:55]--[2019-02-18 Mon 20:00] =>  0:05
    CLOCK: [2019-02-18 Mon 22:05]--[2019-02-18 Mon 23:00] =>  0:55
    :END:      
    - [X] Understanding Node
*** DONE DS/Algo Foundation
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 1.75
    :ACTUAL:   1.63
    :OWNER: sidntrivedi
    :ID: READ.1549883885
    :TASKID: READ.1549883885
    :END:      
    :LOGBOOK:  
    CLOCK: [2019-02-17 Sun 12:39]--[2019-02-17 Sun 13:16] =>  0:37
    CLOCK: [2019-02-14 Thu 19:17]--[2019-02-14 Thu 20:18] =>  1:01
    :END:      
    - [X] Asymptotic analysis (Big-O notation)
*** DONE Linux for you and me
    CLOSED: [2019-02-18 Mon 23:00]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   0.73
    :OWNER: sidntrivedi
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:      
    :LOGBOOK:
    CLOCK: [2019-02-18 Mon 23:10]--[2019-02-18 Mon 23:54] =>  0:0
    :END:      
    - [X] File Permissions	()
      
